---
kind: property
id: P:Autodesk.Revit.DB.Macros.MacroManager.Count
source: html/f45c467a-b777-db16-cd48-87ae7deda4c1.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.Count Property

The count.

## Syntax (C#)
```csharp
public int Count { get; }
```